fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "";
	Если Параметры.Свойство("Адрес", Адрес) Тогда
		СтруктураДанных = ПолучитьИзВременногоХранилища(Адрес);
		Год = СтруктураДанных.Год;
		ТЧ.Загрузить(СтруктураДанных.ДанныеТаблицы);
	КонецЕсли;
	
	МаксимальноеЧислоДнейОтпуска = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
	ЗаполнитьДиаграммуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуНаСервере()
	
	ГрафикОтпусков.Очистить();
	ГрафикОтпусков.Обновление = Ложь;
	ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	
	ЭлементМеток = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.Месяц; 
	ЭлементМеток.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	ЭлементМеток.Формат = "ДФ=MMММ;";
	
	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	Серия.ШтриховкаПерекрывающихсяИнтервалов = Истина;
	Серия.ПриоритетЦвета = Истина;
	
	ВсегоДнейПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		ТекущийИтог = ВсегоДнейПоСотрудникам.Получить(СтрокаТЧ.Sотрудник);
		ТекущийИтог = ?(ТекущийИтог = Неопределено, 0, ТекущийИтог);
		ВсегоДнейПоСотрудникам.Вставить(СтрокаТЧ.Сотрудник, ТекущийИтог + СтрокаТЧ.ДнейОтпуска);
	КонецЦикла;
		
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		// Раскрашиваем точку на основании собранных итогов
		ОбщееКоличествоДней = ВсегоДнейПоСотрудникам.Получить(СтрокаТЧ.Сотрудник);
		Если ОбщееКоличествоДней > МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.СветлоРозовый;
		ИначеЕсли ОбщееКоличествоДней < МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.ЦианСветлый;
		ИначеЕсли ОбщееКоличествоДней = МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.Белый;
		КонецЕсли;
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		// Добавляем интервал отпуска на шкалу времени
		Интервал = Значение.Добавить(); 
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец  = СтрокаТЧ.ДатаОкончания; 
		
	КонецЦикла;
	
	ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
